Repository: julienmalard/traDSSAT
Catalog: docs/source/_locale/*/LC_MESSAGES/api.po
Languages: fr

source: API Reference
fr: Référence de l'IPA

source: TraDSSAT allows users to access files directly or to manage them through the high-level interface.
fr: TraDSSAT permet aux utilisatrices et utilisateurs d'accéder les fichiers directement autant qu'à travers son interface de haut niveau.

source: File managers
fr: Gestionnaires de fichiers

source: All DSSAT file reading and editing happens through subclasses of these parent classes.
fr: Tout ce qui traite de lecture et de modification de fichiers DSSAT est effectué par des sous-classes de ces classes gabarit.

source: Input files
fr: Fichiers d'entrée

source: All input files inherit from :class:`~tradssat.tmpl.InpFile`.
fr: Tous les fichiers d'entrée héritent de :class:`~tradssat.tmpl.InpFile`.

source: File reader for soil (.SOL) DSSAT files.
fr: Lecteur pour les fichiers de sol (.SOL) de DSSAT.

source: Reader for DSSAT weather (.WTH and .WTG) files.
fr: Lecteur pour les fichiers de météo (.WTH et .WTG) de DSSAT.

source: File reader for all DSSAT (.ccX) experiment files.
fr: Lecteur pour les fichiers d'expérience (.ccX) de DSSAT.

source: Cultivar (.CUL) input file reader.
fr: Lecteur de fichiers de cultivar (.CUL).

source: Ecotype (.ECO) input file reader.
fr: Lecteur de fichiers d'écotype (.ECO).

source: Output files
fr: Fichiers de sortie

source: Most output files inherit from :class:`~tradssat.tmpl.OutFile`.
fr: La majorité des fichiers de sortie héritent de :class:`~tradssat.tmpl.OutFile`.

source: File reader for DSSAT plant growth (PLANTGRO.OUT) output files.
fr: Lecteur pour les fichiers de résultats de croissance de culture (PLANTGRO.OUT) de DSSAT.

source: Reader for DSSAT soil nitrogen (SOILNI.OUT) files.
fr: Lecteur pour les fichiers de résultats d'azote des sols (SOILNI.OUT) de DSSAT.

source: Reader for DSSAT soil temperature (SOILTEMP.OUT) output files.
fr: Lecteur pour les fichiers de résultats de température des sols (SOILTEMP.OUT) de DSSAT.

source: Reader for DSSAT run summary (SUMMARY.OUT) output files.
fr: Lecteur pour les fichiers de résumé de simulation (SUMMARY.OUT) de DSSAT.

source: High-level API
fr: IPA de haut niveau

source: The high-level API simplifies work with more complex DSSAT files, espcially ones that reference each other.
fr: L'IPA de haut niveau simplifie le travail associé avec la gestion des fichiers DSSAT plus complexes, surtout lorsqu'il y a des références vers d'autres fichiers.

source: Run input managers
fr: Gestionnaires d'entrées de simulation

source: General manager for DSSAT run input files.
fr: Gestionnaire général pour les fichiers d'entrée de DSSAT.

source: Adds a factor level to the experiment.
fr: Ajoute un facteur à l'expérience.

source: Parameters
fr: Paramètres

source: Factor code or name.
fr: Code ou nom du facteur.

source: Dictionnary of variable values for that factor level's variables. Missing variables will be assigned the corresponding missing code (usually -99).
fr: Dictionnaire des valeurs des variables pour ce facteur. Les variables manquantes seront assignées le code correspondant pour les valeurs manquantes (généralement -99).

source: Adds a treatment level to the experiment.
fr: Ajoute un niveau de traitement à l'expérience.

source: Name of the new treatment.
fr: Le nom du nouveau traitement.

source: Dictionnary of values for the `R`, `O`, and `C` treatment level options (optional).
fr: Dictionnaire des valeurs pour les options `R`, `O` et `C` du niveau de traitement (facultatif).

source: Dictionnary of values for the treatment's factor levels (optional). Missing factors will be assigned level 0.
fr: Dictionnaire des valeurs pour les niveaux des facteurs du traitement (facultatif). Les facteurs manquants seront assignés le niveau 0.

source: Obtain the variable value for a specific factor level.
fr: Obtenir la valeur d'une variable pour un niveau de facteur spécifique.

source: The variable of interest.
fr: La variable d'intérêt.

source: The factor level corresponding to the specified variable.
fr: Le niveau de facteur correspondant à la variable spécifiée.

source: Returns
fr: Retourne

source: The variable value at the factor level.
fr: La valeur de la variable pour le niveau du facteur.

source: Return type
fr: Type de retour

source: Obtain a variable value from the `GENERAL` section of the EXP file.
fr: Obtenir une valeur de variable de la section `GENERAL` du fichier EXP.

source: Variable name
fr: Le nom de la variable

source: Variable value.
fr: La valeur de la variable

source: Obtain the factor level for a specific treatment.
fr: Obtenir le niveau de facteur pour un traitement donné.

source: Treatment name or number.
fr: Nom ou numéro du traitement.

source: Factor name or code.
fr: Nom ou code du facteur.

source: The factor level corresponding to the given treatment.
fr: Le niveau de facteur correspondant au traitement donné.

source: Returns the treatment name corresponding to a treatment number.
fr: Retourne le nom du traitement correspondant au numéro de traitement donné.

source: The treatment number.
fr: Le numéro de traitement.

source: The treatment name.
fr: Le nom du traitement.

source: Returns the treatment number corresponding to a specified treatment name.
fr: Retourne le numéro de traitement correspondant au nom de traitement spécifié.

source: The corresponding treatment number.
fr: Le nom du traitement correspondant.

source: Returns the value of a treatment's variable.
fr: Retourne la valeur d'une variable du traitement.

source: The treatment name or number.
fr: Le nom ou numéro de traitement.

source: The variable value for the treatment.
fr: La valeur de la variable pour le traitement.

source: Removes a treatment from the experiment.
fr: Efface un traitement de l'expérience.

source: Sets a variable value in the `GENERAL` section of the EXP file.
fr: Définit la valeur d'une variable dans la section `GENERAL` du fichier EXP.

source: Variable name.
fr: Le nom de la variable.

source: New value for the variable.
fr: La nouvelle valeur pour la variable.

source: Sets the factor level for a treatment.
fr: Définit le niveau d'un facteur d'un traitement.

source: The factor name or code.
fr: Le nom ou code du facteur.

source: The new factor level.
fr: Le nouveau niveau du facteur.

source: Returns the treatments in the run.
fr: Retourne les traitements présents dans la simulation.

source: Whether to return treatment names or numbers.
fr: Si vous voulez les noms ou les numéros des traitements.

source: The list of treatments.
fr: La liste des traitements.

source: Run output manager
fr: Gestionnaire des résultats de simulation

source: Facilitates the reading of DSSAT results. Instead of having to read each output file individually, you can simply point this class to a DSSAT run output folder containing the output files and it will find the desired variables for you.
fr: Facilite la lecture des résultats de DSSAT. Plutôt que de devoir lire chaque fichier de résultat un par un, vous n'avez qu'à donner à cette classe un dossier contenant les résultats d'une simulation DSSAT pour qu'elle y trouve les variables que vous voulez.

source: Returns a variable's final value. Faster than :func:`get_value` if the variable is available in `Summary.OUT`.
fr: Retourne la valeur finale d'une variable. Plus rapide que :func:`get_value` si la variable est disponible dans `Summary.OUT`.

source: The variable name.
fr: Le nom de la variable

source: The treatment number of interest.
fr: Le numéro du traitement d'intérêt.

source: The variable's final value.
fr: La valeur final de la variable.

source: Returns the value (point or time-series) of a variable from a DSSAT run.
fr: Retourne la valeur (ponctuelle ou en série chronologique) d'une variable d'une simulation de DSSAT.

source: The time at which one wants the results. If ``None``, results will be given for all time steps.
fr: Le temps duquel vous voulez les résultats. Si vous donnez ``None``, les résultats de chaque point temporel seront retournés.

source: Must be one of ``DAS`` (days after start), ``DAP`` (days after planting), or ``YEAR DOY`` (year, day of year; default). Only used if ``t`` is not ``None``.
fr: Doit être l'un de ``DAS`` (jours depuis le début), ``DAP`` (jours après la semence), ou ``YEAR DOY`` (année, jour de l'année ; valeur par défaut). Seulement utilisé si ``t`` n'est pas ``None``.

source: The value of the variable.
fr: La valeur de la variable

source: Reload data (useful if a new DSSAT simulation has been run).
fr: Recharger les données (util si une nouvelle simulation de DSSAT a été exécutée).

source: traDSSAT internals
fr: Fonctionnement interne de traDSSAT

source: This references traDSSAT's (mostly) internal API and is really only useful if you are planning on contributing to or changing a few things in the source code itself.
fr: Cette section document l'IPA (en majorité) interne de DSSAT et n'est util que si vous planifiez vous-même contribuer ou apporter des modifications au code source.

source: Input and output files
fr: Fichiers d'entrée et de résultats

source: All file objects, whether input or output, inherit from the abstract class :mod:`~tradssat.tmpl.File` and all of its methods.
fr: Tous les objets de fichiers, qu'ils soient d'entrée ou de résultats, héritent de la classe abstraite :mod:`~tradssat.tmpl.File` et de toutes ses méthodes.

source: Parent class for all input files, as well as for `Summary.OUT`.
fr: Classe mère pour tous les fichiers d'entrée, autant que pour `Summary.OUT`.

source: Checks whether the file has been edited and needs to be rewritten.
fr: Vérifie si le fichier a été édité et doit être réécrit.

source: Whether the file has been edited or not.
fr: Si le fichier a été édité ou non.

source: Checks whether a given file can be read by this class.
fr: Vérifie si un fichier donné peut être lu par cette classe.

source: The filename or full path to be read.
fr: Le nom du fichier à lire, ou son chemin complet.

source: ``True`` if the file matches; ``False`` otherwise.
fr: ``True`` si le fichier correspond ; ``False`` sinon.

source: Parent class for (nearly all) DSSAT output files.
fr: Classe mère pour (quasiment) tous les fichiers de résultat DSSAT.

source: File template
fr: Gabarit de fichier

source: Parent class for all file objects.
fr: Classe mère pour tous les objets fichier.

source: Returns the size of a variable.
fr: Retourne la taille d'une variable.

source: The name of the variable.
fr: Le nom de la variable.

source: The name of the section in which this variable appears (optional; for ambiguous cases where a file has several variables with the same code).
fr: Le nom de la section dans laquelle cette variable apparaît (facultatif ; utilisé pout les cas ambigües ou un fichier contient plusieurs variables avec le même code).

source: The size of the variable.
fr: La taille de la variable

source: Checks whether a given file can be read by this class. Must be implemented in subclasses.
fr: Vérifie si un fichier donné peut être lu par cette classe. Doit être implémenté dans les sous-classes.

source: The file to be read.
fr: Le fichier à lire.

source: Values
fr: Valeurs

source: Internal structure to organise DSSAT file data and variable values.
fr: La structure interne utilisé pour organiser les données de fichier DSSAT et les valeurs de leurs variables.

source: Represents the set of values in a DSSAT file.
fr: Représente l'ensemble des valeurs dans un fichier DSSAT.

source: Adds a row to the file.
fr: Ajoute un rangée au fichier.

source: Name of section.
fr: Nom de la section.

source: Subsection number. If ``None``, will add row to all subsections.
fr: Numéro de la sous-section. Si ``None``, un rangée sera ajoutée à toutes les sous-sections.

source: Dictionnary of new row variable values.
fr: Dictionnaire des valeurs de variables pour la nouvelle rangée.

source: Adds a section to the file.
fr: Ajoute une section au fichier.

source: Name of the new section.
fr: Nom de la nouvelle section.

source: Detects if any variable values have been changed.
fr: Détecte si les valeurs des variables ont changées.

source: Finds the section in which a variable appears.
fr: Trouve la section dans laquelle apparaît une variable

source: The name of the variable
fr: Le nom de la variable

source: The file section name.
fr: Le nom de la section du fichier.

source: Converts the file to a dictionnary.
fr: Convertie le fichier à un dictionnaire.

source: Writes the file.
fr: Écrit le fichier.

source: List to which to write output lines.
fr: La liste à laquelle les lignes de sortie seront écrites.

source: The modified list.
fr: La liste modifiée.

source: Represents DSSAT file header variables and their values.
fr: Représente les variables d'entête de fichier DSSAT et leurs valeurs.

source: Checks if the header variables values have been changed.
fr: Vérifie si les valeurs des variables d'entête ont été changées.

source: Obtain the value of a header variable.
fr: Obtenir la valeur d'une variable d'entête.

source: Sets the variables of the header.
fr: Définie les variables de l'entête.

source: The subsection with variables and their values already specified.
fr: La sous-section avec ses variables et leurs valeurs déjà spécifiées.

source: Convert to dictionnary (json) format.
fr: Convertir au format de dictionnaire (json).

source: The (mostly) jsonified version of the header's variables.
fr: Les variables de l'entête en format (pas mal) jsonifié.

source: Writes the header values to a string.
fr: Écrit les valeurs de l'entête vers une valeur de chaîne.

source: Represents the structure and variable values in a DSSAT file section.
fr: Représente la structure et les valeurs des variables d'une section d'un fichier de DSSAT.

source: Add a subsection to the section.
fr: Ajoute une sous-section à la section.

source: The new subsection.
fr: La nouvelle sous-section.

source: Checks whether any value has changed in the section.
fr: Vérifie si une valeur a été changée dans la section.

source: The value of the header variable.
fr: La valeur de la variable d'entête.

source: Sets the section's header variables.
fr: Définit les variables de l'entête de la section.

source: The subsection representing the header variables.
fr: La sous-section représentant les variables d'entête.

source: Converts the section to a dictionnary.
fr: Convertit la section en dictionnaire.

source: Writes the section to a list of lines.
fr: Écrit la section en liste de lignes.

source: The list of lines to which to append this section.
fr: La liste de lignes à laquelle ajouter cette section.

source: Represents the variables and values in a DSSAT file subsection.
fr: Représente les variables d'une sous-section d'un fichier DSSAT avec leurs valeurs.

source: Adds a row to the subsection.
fr: Ajoute une rangée à la sous-section.

source: The values for the new row. Any missing value will be assigned the corresponding missing code for that variable (usually -99).
fr: Les valeurs pour la nouvelle rangée. Si un valeur manque, elle sera assigné le code de valeur manquante correspondant (généralement -99).

source: Checks whether any variable in the subsection has been changed.
fr: Vérifie si une variable dans la sous-section a changé de valeur.

source: Checks that all variables in the subsection have the same size. (If not, the subsection cannot write to disk.)
fr: Vérifie que toutes les variables dans la sous-section ont la même taille (sinon, la sous-section ne pourra être sauvegarder sur le disque).

source: Obtain the size of variables. Will fail if not all variables have the same size.
fr: Obtenir la taille des variables. Soulèvera une erreur si toutes les variables n'ont pas la même taille.

source: The size of all variables in the subsection.
fr: La taille de toutes les variables de la sous-section.

source: Converts the subsection to a dictionnary.
fr: Convertie la sous-section en dictionnaire.

source: Writes the subsection.
fr: Écrit la sous-section.

source: The list of lines to which to append this subsection.
fr: La liste de lignes à laquelle ajouter cette sous-section.

source: Represents a DSSAT file variable.
fr: Représente une variable de fichier DSSAT.

source: Adds a value to the variable's matrix.
fr: Ajoute une valeur à la matrice de la variable.

source: The new value.
fr: La nouvelle valeur.

source: Removes a value from the variable's matrix.
fr: Enlève une valeur de la matrice de la variable.

source: The indices of the value(s) to remove. May be a list of indices, or else a boolean mask of the same size as the variable.
fr: Les indices des valeur(s) à effacer. Cela peut être une liste d'indices, ou bien un masque booléen de la même taille que la variable.

source: Changes the value of the variable.
fr: Modifie la valeur de la variable

source: Índices at which to change the value. If ``None``, all values of the variable will be changed.
fr: Les indices auxquels changer la valeur. Si ``None``, toutes les valeurs de la variable seront changées.

source: Returns the size of the variable.
fr: Retourne la taille de la variable.

source: Converts the variable to a string.
fr: Convertie la variable en chaîne.

source: The index of the value to write. If ``None``, the name of the variable will be written instead.
fr: L'indice de la valeur à écrire. Si ``None``, le nom de la variable sera écrit à la place.

source: The properly written and formatted variable.
fr: La variable, correctement formatée et écrite en format de chaîne.

source: Variable types used to specify DSSAT file variables.
fr: Les types de variables utilisés pour spécifier les variables des fichiers DSSAT.

source: Character (string) variable.
fr: Variable texte (chaîne).

source: Floating point (decimal) variable.
fr: Variable de virgule flottante.

source: Organiser for the allowed header variables of a DSSAT file type.
fr: Organisateur pour les variables d'entête permises pour une classe de fichier DSSAT.

source: Integer (whole number) variable.
fr: Variable de chiffre entier.

source: Parent class for numeric variable types.
fr: Classe mère pour les types de variable numériques.

source: Parent class for all variable types.
fr: Classe mère pour tous les types de variable.

source: Organiser for the allowed variables of a DSSAT file type.
fr: Organisateur pour les variables permises dans une classe de fichier DSSAT.
