Repository: julienmalard/traDSSAT
Catalog: docs/source/_locale/*/LC_MESSAGES/high_level.po
Languages: fr

source: High-level interface
fr: Interface de haut niveau

source: The high-level interface simplifies many tasks while working with DSSAT input and output files.
fr: L'interface d'haut niveau simplifie beaucoup de tâches communes lorsque vous travaillez avec des fichiers d'entrée et de sortie de DSSAT.

source: Input files
fr: Fichiers d'entrée

source: Each of these managers creates a more friendly interface to DSSAT files than that of the base input file reader.
fr: Chacun de ces gestionnaires crée une interface plus intuitive pour les fichiers DSSAT que celle des lecteurs de fichier de base.

source: Experiment file manager
fr: Gestionnaire de fichier d'expérience

source: :class:`~tradssat.mgrs.DSSATRun` allows you to read, edit and write experiments, with automatic access to referenced external soil, genetic and weather files. TraDSSAT will also automagically manage the link between DSSAT treatments and associated factor levels (if you don't know what this means, now would be a great time to stop reading this and read the DSSAT docs instead).
fr: :class:`~tradssat.mgrs.DSSATRun` vous permet d'éditer et d'écrire des expériences, et cela avec accès automatique aux fichiers externes de sol, génétique et météo associés. En plus, TraDSSAT gère automagiquement le lien entre des traitements de DSSAT et les niveaux de facteurs associés (si vous ne savez pas de quoi je parle, ce serait un bon moment d'arrêter de lire ceci et d'aller lire la documentation de DSSAT à la place).

source: Genetic file manager
fr: Gestionnaire de fichier de génétique

source: DSSAT's crop modules generally split coefficients between cultivar, ecotype and species files. TraDSSAT provides a :class:`~tradssat.mgrs.GeneticMgr` class to automagically manage all genetic coefficients for a particular crop and cultivar type.
fr: Les modules de culture de DSSAT séparent généralement les coefficients entre fichiers de cultivar, d'écotype et d'espèce. TraDSSAT offre la classe :class:`~tradssat.mgrs.GeneticMgr` pour automagiquement gérer tous les coefficients génétiques pour cultivar donné.

source: It is currently not possible to access species coefficients with traDSSAT, because these are in practice model constants and should not be written or changed (and, if they were, would also by default affect **all future** DSSAT simulations run on your DSSAT installation). More practically, they also come in a variety of formats and would be a pain to parse.
fr: Il est actuellement impossible d'accéder aux coefficients d'espèce avec traDSSAT, parce que ceux-ci sont en pratique des constants du modèle et ne devraient pas être modifiés ou changés (et, s'ils l'étaient, auraient aussi comme effet d'affecter **toutes les simulations futures** de votre installation de DSSAT). D'un point de vue plus pratique, il y a aussi le fait que ces fichiers viennent dans une multitude de formats et seraient donc un drôle de casse-tête à analyser).

source: Soil file manager
fr: Gestionnaire de fichier de sol

source: Soil files can be hard to manage, since they can contain data for many different soils in the same file. With :class:`~tradssat.mgrs.SoilMgr`, simply pass the soil code and traDSSAT will find the correct file and file section.
fr: Les fichiers de sol peuvent être difficiles à gérer, parce qu'ils peuvent contenir les données de beaucoup de différents sols dans le même fichiers. Avec la classe :class:`~tradssat.mgrs.SoilMgr`, vous n'avez qu'à spécifier le code du sol et traDSSAT trouvera le fichier et la section correspondants.

source: Weather file manager
fr: Gestionnaire de fichier de météo

source: Don't feel like finding your weather file yourself? Just give the station code to :class:`~tradssat.mgrs.WeatherFileMgr` and let it find it for you.
fr: Vous n'avez pas le goût de chercher vous-même pour le fichier de météo dont vous avez de besoin ? Vous n'avez qu'à donner le code de la station à :class:`~tradssat.mgrs.WeatherFileMgr` et elle la trouvera pour vous.

source: Output files
fr: Fichiers de sortie

source: You can access output from a run using a :class:`~tradssat.mgrs.DSSATResults` object instantiated with the output directory.
fr: Vous pouvez accéder les résultats d'une simulation à l'aide d'un objet :class:`~tradssat.mgrs.DSSATResults` initialisé avec le dossier contenant les résultats.
