Repository: julienmalard/traDSSAT
Catalog: docs/source/_locale/*/LC_MESSAGES/inputs.po
Languages: fr

source: Input files
fr: Fichiers d'entrée

source: TraDSSAT has specific classes to read and edit DSSAT input files. Each class defines its own allowed variables and variable information. All files have the same general structure:
fr: TraDSSAT est dotée de classes spécifiques pour lire et éditer les fichiers d'intrant de DSSAT. Chaque classe définie ses propres variables permises, autant que les paramètres de celles-ci. Tous les fichiers ont la même structure générale :

source: Section (named; header line starts with ``*`` or ``$`` in DSSAT files)
fr: Section (nommée ; l'entête commence avec un ``*`` ou un ``$`` dans les fichiers de DSSAT)

source: Section header variables (optional)
fr: Variables d'entête de section (facultatif)

source: Subsection (numbered; header line starts with ``@`` followed by variable names in DSSAT files)
fr: Sous-section (numérotée ; l'entête commence avec un ``@`` suivit des noms des variables dans un fichier DSSAT)

source: Subsection variables
fr: Variables de sous-section

source: Specific classes used to read DSSAT input files are:
fr: Les classes utilisées pour lire les fichiers d'entrée de DSSAT sont :

source: As all input files inherit from :class:`~tradssat.tmpl.InpFile`, the same interface to reading, editing and writing holds for all DSSAT input files.
fr: Vu que tous les fichiers d'entrée héritent de :class:`~tradssat.tmpl.InpFile`, la même interface s'applique pour la lecture, la modification et l'écriture de tous les fichiers d'entrée DSSAT.

source: Reading files
fr: Lecture de fichiers

source: Input files are instantiated with the path to the file to be read.
fr: Les fichiers d'entrée sont initialisés avec le chemin du fichier à lire.

source: Values of all variables can then be read directly.
fr: Les valeurs de toutes les variables peuvent ensuite être lues directement.

source: Getting a list of all allowed variable names for the file type is also easy.
fr: C'est aussi facile d'obtenir une liste de tous les noms de variable permis pour le type de fichier.

source: Editing files
fr: Modification des fichiers

source: Variable values can be changed, either for the whole file or for specific sections and/or subsections, as well as by condition.
fr: Vous pouvez changer les valeurs des variables, qu'il s'agisse du fichier en entier ou d'une section ou sous-section particulière, autant que selon une condition.

source: You can also add rows to specific subsections of a file, or remove existing rows. Subsection variables not included in ``vals`` will be set to missing (usually -99).
fr: Vous pouvez aussi ajouter des rangées à des sous-sections spécifiques d'un fichier, ou bien enlever des rangées existantes. Les variables de sous-section non spécifiées dans ``vals`` seront assignée une valeur manquante (généralement -99).

source: You can save the data to json format, or else write a DSSAT-format file back to disk.
fr: Vous pouvez sauvegarder les données en format json, ou bien écrire un fichier en format DSSAT sur le disque.
